Documents/бит_ЗаявлениеТСЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ЗаявлениеТСЖ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ЧленыТСЖ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацииЗаявлениеТСЖ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТСЖ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЧленовТСЖ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыхода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГолосов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проживающий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ИнформацияТСЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ИнформацияТСЖ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Председатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролирующийОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОрганыФМС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТСЖ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ЧленыТСЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЧленыТСЖ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоГолосов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТСЖ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидыОперацииЗаявлениеТСЖ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацииЗаявлениеТСЖ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВступлениеВТСЖ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыходИзТСЖ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_ЗаявлениеТСЖ/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийЭлементовФормы

// БИТ_ЖКХ 29.07.2016 11:00:28 Начало правки... 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// БИТ ЖКХ 14.01.2020
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// СтандартныеПодсистемы.Печать
	//УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаПечать);
	// Конец СтандартныеПодсистемы.Печать
	Элементы.ГруппаПечать.Вид = ВидГруппыФормы.Подменю;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
    УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры
// БИТ_ЖКХ 29.07.2016 11:00:31 Конец правки.

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	//Для каждого СтрокаТаблицы Из Объект.СписокЧленовТСЖ Цикл
	//	СтрокаТаблицы.ДатаВыхода = Дата("00010101");
	//КонецЦикла;
	
	Объект.СписокЧленовТСЖ.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТСЖНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьСписокТСЖ(Объект.Дата, Объект.Организация);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляСписокЧленовТСЖ

&НаКлиенте
Процедура СписокЧленовТСЖПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущаяСтрока = Элементы.СписокЧленовТСЖ.ТекущиеДанные;
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацииЗаявлениеТСЖ.ВступлениеВТСЖ") Тогда
			ТекущаяСтрока.ДатаВступления = Объект.Дата;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЧленовТСЖЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Здание", ПолучитьСписокЗданийВТСЖ(Объект.Дата, Объект.ТСЖ, Объект.Организация));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЧленовТСЖЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.СписокЧленовТСЖ.ТекущиеДанные;
	
	Если НЕ ВыбранноеЗначение = ТекущаяСтрока.ЛицевойСчет Тогда
		ТекущаяСтрока.Проживающий = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЧленовТСЖПроживающийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.СписокЧленовТСЖ.ТекущиеДанные;
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		ДанныеВыбора = ПолучитьСписокВладельцев(Объект.Дата, ТекущаяСтрока.ЛицевойСчет, Объект.ТСЖ, Объект.ВидОперации);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЧленовТСЖПроживающиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.СписокЧленовТСЖ.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено И НЕ ВыбранноеЗначение = ТекущаяСтрока.Проживающий
		И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацииЗаявлениеТСЖ.ВыходИзТСЖ") Тогда
		
		ЗаполнитьИнформациюОЧленеТСЖвСтроке(ТекущаяСтрока.ПолучитьИдентификатор(), ВыбранноеЗначение);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЧленовТСЖДатаВыходаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СписокЧленовТСЖ.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		Если ТекущаяСтрока.ДатаВступления > ТекущаяСтрока.ДатаВыхода Тогда
			ТекущаяСтрока.ДатаВыхода = ?(ТекущаяСтрока.ДатаВступления < ТекущаяДата(),ТекущаяДата(), ТекущаяСтрока.ДатаВступления); 
		КонецЕсли;
		
		ТекстСообщения = НСтр("ru = 'Дата выхода из ТСЖ не может быть позже даты встпления.'");
		ТекстСообщения = бит_ОбщегоНазначенияКлиентСервер.ПолучитьТекстСообщения("Поле", "Корректность", НСтр("ru = 'ДатаВыхода'"),,,ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Элемент.Имя);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервереБезКонтекста
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьСписокТСЖ(Период, Организация)
	
	СписокТСЖ = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , КонецДня(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ИнформацияТСЖСрезПоследних.ТСЖ
	|ИЗ
	|	РегистрСведений.бит_ИнформацияТСЖ.СрезПоследних(&Период, ) КАК бит_ИнформацияТСЖСрезПоследних
	|ГДЕ
	|	(бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия > &Период)
	|	И бит_ИнформацияТСЖСрезПоследних.Здание.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ИнформацияТСЖСрезПоследних.ТСЖ";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Таблица = Результат.Выгрузить();
		СписокТСЖ.ЗагрузитьЗначения(Таблица.ВыгрузитьКолонку("ТСЖ"));
		
	КонецЕсли; 
	
	Возврат СписокТСЖ;
	
КонецФункции // ()

&НаСервереБезКонтекста
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьСписокЗданийВТСЖ(Период, ТСЖ, Организация)
	
	СписокЗданий = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , КонецДня(Период));
	Запрос.УстановитьПараметр("ТСЖ"        , ТСЖ);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ИнформацияТСЖСрезПоследних.Здание
	|ИЗ
	|	РегистрСведений.бит_ИнформацияТСЖ.СрезПоследних(&Период, ТСЖ = &ТСЖ) КАК бит_ИнформацияТСЖСрезПоследних
	|ГДЕ
	|	(бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ИнформацияТСЖСрезПоследних.ДатаЗакрытия > &Период)
	|	И бит_ИнформацияТСЖСрезПоследних.Здание.Организация = &Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ИнформацияТСЖСрезПоследних.Здание";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Таблица = Результат.Выгрузить();
		СписокЗданий.ЗагрузитьЗначения(Таблица.ВыгрузитьКолонку("Здание"));
		
	КонецЕсли;
	
	Возврат СписокЗданий;
	
КонецФункции // ()

&НаСервереБезКонтекста
// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция ПолучитьСписокВладельцев(Период, ЛицевойСчет, ТСЖ, ВидОперации)
	
	СписокВладельцев = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , КонецДня(Период));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("ТСЖ"        , ТСЖ);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЧленыТСЖСрезПоследних.ЛицевойСчет,
	|	бит_ЧленыТСЖСрезПоследних.ФизЛицо
	|ПОМЕСТИТЬ ЧленыТСЖ
	|ИЗ
	|	РегистрСведений.бит_ЧленыТСЖ.СрезПоследних(
	|			&Период,
	|			ТСЖ = &ТСЖ
	|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_ЧленыТСЖСрезПоследних
	|ГДЕ
	|	(бит_ЧленыТСЖСрезПоследних.ДатаВыхода = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ЧленыТСЖСрезПоследних.ДатаВыхода > &Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Проживающие.ФизЛицо
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Период,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И НЕ ФизЛицо В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							Таб.ФизЛицо
	|						ИЗ
	|							ЧленыТСЖ КАК Таб)) КАК Проживающие
	|ГДЕ
	|	Проживающие.ВладелецКвартиры = ЗНАЧЕНИЕ(Перечисление.данет.да)
	|	И (Проживающие.ДатаСнятияСРегистрации > &Период
	|			ИЛИ Проживающие.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|
	|СГРУППИРОВАТЬ ПО
	|	Проживающие.ФизЛицо";
	
	Если НЕ ВидОперации = Перечисления.бит_ВидыОперацииЗаявлениеТСЖ.ВступлениеВТСЖ Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕ ФизЛицо В", "ФизЛицо В");
	КонецЕсли; 
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Таблица = Результат.Выгрузить();
		СписокВладельцев.ЗагрузитьЗначения(Таблица.ВыгрузитьКолонку("ФизЛицо"));
		
	КонецЕсли;
	
	Возврат СписокВладельцев;
	
КонецФункции // ()

&НаСервереБезКонтекста
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Функция ПолучитьИнформациюОЧленеТСЖ(Период, ТСЖ, ЛицевойСчет, Проживающий)
	
	ИнформацияОЧленеТСЖ = Новый Структура;
	ИнформацияОЧленеТСЖ.Вставить("ДатаВступления", Дата("00010101"));
	ИнформацияОЧленеТСЖ.Вставить("ДатаВыхода"    , ТекущаяДата());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"     , КонецДня(Период));
	Запрос.УстановитьПараметр("ТСЖ"        , ТСЖ);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Проживающий", Проживающий);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЧленыТСЖ.ДатаВступления,
	|	ЧленыТСЖ.ДатаВыхода
	|ИЗ
	|	РегистрСведений.бит_ЧленыТСЖ.СрезПоследних(
	|			&Период,
	|			ТСЖ = &ТСЖ
	|				И ЛицевойСчет = &ЛицевойСчет
	|				И ФизЛицо = &Проживающий) КАК ЧленыТСЖ
	|ГДЕ
	|	(ЧленыТСЖ.ДатаВыхода > &Период
	|			ИЛИ ЧленыТСЖ.ДатаВыхода = ДАТАВРЕМЯ(1, 1, 1))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ИнформацияОЧленеТСЖ.ДатаВступления = Выборка.ДатаВступления; 
		ИнформацияОЧленеТСЖ.ДатаВыхода     = Выборка.ДатаВыхода;
		
	КонецЕсли;
	
	Возврат ИнформацияОЧленеТСЖ;
	
КонецФункции // () 

&НаКлиенте
Процедура Печать(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ТекстСообщения = НСтр("ru = 'Перед печатью запишите документ.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
	КонецЕсли; 
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Параметры.Ключ);
	
	//Результат = Документы.бит_ЗаявлениеТСЖ.ПечатьДокумента(МассивОбъектов);
	//
	//УниверсальныеМеханизмы.НапечататьДокумент(Результат,,,"Свидетельство о регистрации по месту жительства");
	
КонецПроцедуры

&НаКлиенте
Процедура ТСЖОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Период", Объект.Дата);
	ПараметрыФормы.Вставить("ТСЖ"   , Объект.ТСЖ);
	
	ОткрытьФорму("ОбщаяФорма.бит_ИнформацияОТСЖ", ПараметрыФормы, Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоЛС(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Здание", ПолучитьСписокЗданийВТСЖ(Объект.Дата, Объект.ТСЖ, Объект.Организация));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина); 
	ПараметрыФормы.Вставить("Отбор"             , Отбор);
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая" Тогда
		
		ЗаполнитьСписокПоЛС(ВыбранноеЗначение);
		
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗаполнитьСписокПоЛС(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для каждого ЭлементМассива Из ВыбранноеЗначение Цикл
			
			СписокВладельцев = ПолучитьСписокВладельцев(Объект.Дата, ЭлементМассива, Объект.ТСЖ, Объект.ВидОперации);
			
			Для каждого ЭлементСписка Из СписокВладельцев Цикл
				
				Проживающий = ЭлементСписка.Значение;
				
				Отбор = Новый Структура;
				Отбор.Вставить("ЛицевойСчет", ЭлементМассива);
				Отбор.Вставить("Проживающий", Проживающий);
				
				Поиск = Объект.СписокЧленовТСЖ.НайтиСтроки(Отбор);
				
				Если Поиск.Количество() = 0 Тогда
					
					НоваяСтрока = Объект.СписокЧленовТСЖ.Добавить();
					НоваяСтрока.ЛицевойСчет = ЭлементМассива; 
					НоваяСтрока.Проживающий = Проживающий;
					
					Если Объект.ВидОперации = Перечисления.бит_ВидыОперацииЗаявлениеТСЖ.ВыходИзТСЖ Тогда
						ЗаполнитьИнформациюОЧленеТСЖвСтроке(НоваяСтрока.ПолучитьИдентификатор(), Проживающий);
					Иначе
						НоваяСтрока.ДатаВступления = Объект.Дата;
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры // ()

&НаСервере
// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
Процедура ЗаполнитьИнформациюОЧленеТСЖвСтроке(Идентификатор, Проживающий)
	
	ТекущаяСтрока = Объект.СписокЧленовТСЖ.НайтиПоИдентификатору(Идентификатор);
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ИнформацияОЧленеТСЖ = ПолучитьИнформациюОЧленеТСЖ(Объект.Дата, Объект.ТСЖ,
	ТекущаяСтрока.ЛицевойСчет, Проживающий); 
	
	Если ИнформацияОЧленеТСЖ.ДатаВступления = Дата("00010101") Тогда
		
		СтандартнаяОбработка = Ложь;
		ТекстСообщения = НСтр("ru = 'Проживающий не является членом ТСЖ.'");
		ТекстСообщения = бит_ОбщегоНазначенияКлиентСервер.ПолучитьТекстСообщения("ПОЛЕ", "КОРРЕКТНОСТЬ", НСтр("ru = 'Проживающий'"),,,ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "СписокЧленовТСЖПроживающие");
		
		Возврат;
		
	КонецЕсли; 
	
	ТекущаяСтрока.ДатаВступления = ИнформацияОЧленеТСЖ.ДатаВступления;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ДатаВыхода) Тогда
		
		Если НЕ ЗначениеЗаполнено(ИнформацияОЧленеТСЖ.ДатаВыхода) Тогда
			ТекущаяСтрока.ДатаВыхода = ?(ТекущаяСтрока.ДатаВступления < ТекущаяДата(),ТекущаяДата(), ТекущаяСтрока.ДатаВступления);;
		Иначе
			ТекущаяСтрока.ДатаВыхода = ИнформацияОЧленеТСЖ.ДатаВыхода;
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры // () 

#КонецОбласти
